ataradov/free-dap/platform/samd21/main.c
// SPDX-License-Identifier: BSD-3-Clause
// Copyright (c) 2024, Alex Taradov <alex@taradov.com>. All rights reserved.

/*- Includes ----------------------------------------------------------------*/
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdalign.h>
#include <string.h>
#include "samd21.h"
#include "hal_config.h"
#include "nvm_data.h"
#include "usb.h"
#include "uart.h"
#include "dap.h"
#include "dap_config.h"

/*- Definitions -------------------------------------------------------------*/
#define USB_BUFFER_SIZE		64
#define UART_WAIT_TIMEOUT	10	// ms
#define STATUS_TIMEOUT		250	// ms
#define ADC_SAMPLE_INTERVAL	250	// ms
#define POWER_DETECT_THRESHOLD	7432	// 1.1V

/*- Variables ---------------------------------------------------------------*/
static alignas(4) uint8_t app_req_buf_hid[DAP_CONFIG_PACKET_SIZE];
static alignas(4) uint8_t app_req_buf_bulk[DAP_CONFIG_PACKET_SIZE];
static alignas(4) uint8_t app_req_buf[DAP_CONFIG_PACKET_SIZE];
static alignas(4) uint8_t app_resp_buf[DAP_CONFIG_PACKET_SIZE];
static int app_req_buf_hid_size = 0;
static int app_req_buf_bulk_size = 0;
static bool app_resp_free = true;
static uint64_t app_system_time = 0;
static uint64_t app_status_timeout = 0;
static bool app_dap_event = false;

#ifdef HAL_CONFIG_ENABLE_VCP
static alignas(4) uint8_t app_recv_buffer[USB_BUFFER_SIZE];
static alignas(4) uint8_t app_send_buffer[USB_BUFFER_SIZE];
static int app_recv_buffer_size = 0;
static int app_recv_buffer_ptr = 0;
static int app_send_buffer_ptr = 0;
static bool app_send_buffer_free = true;
static bool app_send_zlp = false;
static uint64_t app_uart_timeout = 0;
static uint64_t app_break_timeout = 0;
static bool app_vcp_event = false;
static bool app_vcp_open = false;
#endif

#ifdef HAL_CONFIG_ENABLE_LED_PWMMODE

// based upon 3MHz for TCC
#define PWM_LED_PERIOD    2000
// percentage of LED brigtness, 100 = Full brightness, current set to 5%
#define LED_BRIGHTNESS	  (5 * PWM_LED_PERIOD/100)


extern void custom_hal_gpio_dap_status_toggle();
extern void custom_hal_gpio_dap_status_set();
static void led_custom_init();
#ifdef HAL_CONFIG_ENABLE_VCP
extern void custom_hal_gpio_vcp_status_toggle();
extern void custom_hal_gpio_vcp_status_write(int val);
#endif
#endif

#ifdef HAL_CONFIG_ENABLE_BUTTON
// debounce set to 10ms
#define	BUTTON_DEBOUNCE_TIME	10
#define BUTTON_CLICK_MIN	40
#define BUTTON_CLICK_MAX	250
#define BUTTON_HOLD_MIN 	700
enum button_mode {button_idle, button_click, button_doubletap, button_tripletap, button_hold, button_tap_hold, button_doubletap_hold};
static enum button_mode button_state = button_idle;
#endif

#ifdef HAL_CONFIG_ENABLE_PROVIDE_PWR
#define PWR_PWM_STEP		64U
volatile uint8_t		power_state = 0;	// 0 power off, 1 power on, 2 turning on
uint16_t			power_level = 0;
#endif
//#define BUTTON_DEBUG
//#define ADC_DEBUG
//#define PWR_DEBUG

/*- Implementations ---------------------------------------------------------*/

//-----------------------------------------------------------------------------
#ifdef HAL_CONFIG_ENABLE_PROVIDE_PWR
static void pwr_custom_init()
{
  /* Enable the APB clock for TCC2 */
  PM->APBCMASK.reg |= PM_APBCMASK_TCC2;
  /* Enable GCLK1 and wire it up to TCC2 */
  GCLK->CLKCTRL.reg = GCLK_CLKCTRL_CLKEN |GCLK_CLKCTRL_ID_TCC2_TC3 |
                    GCLK_CLKCTRL_GEN(1);
  /* Wait until the clock bus is synchronized. */
  while (GCLK->STATUS.bit.SYNCBUSY) {};

  /* Configure the clock prescaler for TCC2.
  */
  TCC2->CTRLA.reg |= TCC_CTRLA_PRESCALER(TCC_CTRLA_PRESCALER_DIV1_Val);

  TCC2->PER.reg = PWR_PWM_STEP;
  while (TCC2->SYNCBUSY.bit.PER) {};

  /* Use "Normal PWM" */
  TCC2->WAVE.reg = TCC_WAVE_WAVEGEN_NPWM;
  /* Wait for bus synchronization */
  while (TCC2->SYNCBUSY.bit.WAVE) {};

  /* Invert ouput */
  TCC2->DRVCTRL.reg |= TCC_DRVCTRL_INVEN1;
  /* n for CC[n] is determined by n = x % 4 where x is from WO[x]
   WO[x] comes from the peripheral multiplexer - we'll get to that in a second.
  */
  TCC2->CC[1].reg = 0;
  while (TCC2->SYNCBUSY.bit.CC3) {};

  TCC2->CTRLA.reg |= (TCC_CTRLA_ENABLE);
  while (TCC2->SYNCBUSY.bit.ENABLE) {};

}

static void ext_power_toggle()
{
#ifdef PWR_DEBUG
  static alignas(4) uint8_t  message[12] = {'P','S','=', 0,'L','=',0,0,'\n',0};
  uint16_t dbg = power_state;
  for (int i = 0; i < 1; i++){
    message[3-i] = "0123456789ABCDEF"[dbg & 0xf];
    dbg >>= 4;
  }
  dbg = power_level;
  for (int i = 0; i < 2; i++){
    message[7-i] = "0123456789ABCDEF"[dbg & 0xf];
    dbg >>= 4;
  }
  usb_cdc_send(message,9);
#endif
//  HAL_GPIO_EXT_PWR_toggle();
//  return;
  // if in power up transition, ignore the request
  if ( power_state == 2) return;
  if ( power_state ) {
    // turn off power
    HAL_GPIO_EXT_PWR_set();
    HAL_GPIO_EXT_PWR_pmuxdis();
    power_state = 0;
    return;
  }
  power_state = 2;
  TCC2->CC[1].reg = 0 ;
  TCC2->INTFLAG.reg = TCC_INTFLAG_OVF;
  TCC2->CTRLA.reg |= (TCC_CTRLA_ENABLE);
  while (TCC2->SYNCBUSY.bit.ENABLE) {};
  HAL_GPIO_EXT_PWR_pmuxen(HAL_GPIO_PMUX_E);
}

static void ext_power_task()
{
  if (power_state != 2 ) return;
  if ( !TCC2->INTFLAG.bit.OVF ) return;
  TCC2->INTFLAG.reg = TCC_INTFLAG_OVF;
  power_level ++;
  if ( power_level < PWR_PWM_STEP ) {
    TCC2->CC[1].reg = power_level;
    return;
  }
  // reach full power on
  HAL_GPIO_EXT_PWR_clr();
  HAL_GPIO_EXT_PWR_pmuxdis();
  TCC2->CTRLA.reg &= ~(TCC_CTRLA_ENABLE);
  power_state = 1;
  power_level = 0;
}

#endif


#ifdef HAL_CONFIG_ENABLE_BUTTON
static void button_task(void)
{
  enum key_proc_state { key_proc_idle, key_proc_engaged, key_proc_wait_rel};
  static enum key_proc_state key_state;

#ifdef BUTTON_DEBUG
  static alignas(4) uint8_t  message[14]={'B',':',0,0,0,0,0,0,0,0,',',0,'\n',0};
#endif
  // assuming button has pullup
  static bool last_lvl = true;
  static uint32_t last_time = 0;
  static bool glitch_lvl = true;
  static uint32_t glitch_time = 0;
  static bool glitch_start = false;
  static uint8_t  click_cnt = 0;

  bool lvl = HAL_GPIO_BUTTON_read();
  uint32_t cur_time = app_system_time;
  uint32_t delta ;
  bool changed ;

  delta = cur_time - glitch_time;
  changed = lvl != glitch_lvl;
  if ( changed ) {
    glitch_time = cur_time;
    glitch_lvl = lvl;
  }

